#include<stdio.h>

struct employee {
	int id;
	char name[20];
	char phoneNumber[13];
	int age;
};

int main(void) {
	struct employee member[10] = { { 1, "정성화 1호", "010-4508-4567", 13},
	{ 1, "정성화 2호", "010-4508-4567", 23},
	{ 1, "정성화 3호", "010-4508-4567", 13},
	{ 1, "정성화 4호", "010-4508-4567", 43},
	{ 1, "정성화 5호", "010-4508-4567", 62},
	{ 1, "정성화 6호", "010-4508-4567", 424},
	{ 1, "정성화 7호", "010-4508-4567", 234},
	{ 1, "정성화 8호", "010-4508-4567", 24},
	{ 1, "정성화 9호", "010-4508-4567", 23},
	{ 1, "정성화 10호", "010-4508-4567", 12},
	};
	int i;
	for(i = 0; i < 10; i++){
		if(20 <= member[i].age && member[i].age <= 30) {
			printf("%s\n", member[i].name);
		}
	} 
	return 0;
}



